{
  "status": "success",
  "search_names": [
    "Personal Data Protection Act 2012 (2020 Rev Ed) s 48O",
    "Personal Data Protection Act 2012 (2020 Rev Ed) ss 13–17",
    "Personal Data Protection Act 2012 (2020 Rev Ed) s 18",
    "Personal Data Protection Act 2012 (2020 Rev Ed) s 24",
    "Personal Data Protection Act 2012 (2020 Rev Ed) s 26A–26E"
  ],
  "total_found": 3,
  "total_returned": 3,
  "content_scraped": true,
  "cases": [
    {
      "title": "IN THE COURT OF APPEAL OF THE REPUBLIC OF SINGAPORE - eLitigation",
      "url": "https://www.elitigation.sg/gd/gd/2022_SGCA_60/pdf",
      "snippet": "had contravened ss 13 and 18 of the PDPA (which fall within Part IV) in respect of the appellant’s data but held that the appellant had not suffered any “loss or damage” within the meaning of s 32(1)....",
      "relevance_score": 0.8687726000000001,
      "case_year": null,
      "court": "Court Of Appeal",
      "full_content": "COURT OF APPEAL of the republic of singapore [2022] SGCA 60 Civil Appeal No 174 of 2020 Between Michael Reed … Appellant And Alex Bellingham … Respondent And Attorney-General … Intervener In the matter of Registrar’s Appeal No 24 of 2019 (District Court Originating Summons No 170 of 2018) In the matter of Section 32 of the Personal Data Protection Act 2012 (Act 26 of 2012) Between Alex Bellingham … Appellant And Michael Reed … Respondent judgment [Statutory Interpretation — Construction of statute — Purposive approach — Personal Data Protection Act 2012 (Act 26 of 2012) — Meaning of “loss or damage” in s 32(1) of the Personal Data Protection Act 2012] [Statutory Interpretation — Construction of statute — Purposive approach — Personal Data Protection Act 2012 (Act 26 of 2012) — What amounts to emotional distress that is actionable under s 32(1) of the Personal Data Protection Act 2012] [Statutory Interpretation — Construction of statute — Purposive approach — Personal Data Protection Act 2012 (Act 26 of 2012) — Meaning of “acting in the course of his employment with an organisation” in s 4(1)(b) of the Personal Data Protection Act 2012] * * * This judgment is subject to final editorial corrections approved by the court and/or redaction pursuant to the publisher’s duty in compliance with the law, for publication in LawNet and/or the Singapore Law Reports. Reed, Michael v Bellingham, Alex ( Attorney-General, intervener) [2022] SGCA 60"
    },
    {
      "title": "[2025] SGHC 173 - Singapore Kindness Movement",
      "url": "https://www.elitigation.sg/gd/s/2025_SGHC_173",
      "snippet": "19 As for loss or damage, the DJ observed, citing Reed, Michael v Bellingham, Alex (Attorney-General, intervener)  2 SLR 1156 (“Reed”), that, for claims made under s 48O of the PDPA, there had to be a...",
      "relevance_score": 0.8464752000000001,
      "case_year": "2025",
      "court": "Court Of Appeal",
      "full_content": "Court of Appeal held (at [90], [93], [102] and [107]), in relation to the then-equivalent provision to s 48O of the PDPA, that while s 48O(1) of the PDPA does not exclude emotional distress from the meaning of “loss and damage”, a “strict causal link” is required for such a claim to succeed. This means that the “loss or damage” (including emotional distress) must have been suffered “directly as a result of a contravention” of the PDPA [emphasis in original]. Such a requirement serves as a control mechanism to prevent individuals from commencing frivolous lawsuits against organisations even for minor or technical breaches of the PDPA. 77 In my view, the DJ did not err in applying the strict causal link test stringently (Judgment at [89]). As the DJ correctly observed (Judgment at [90]), such an approach also coheres with Parliament’s intent (see Second Reading at p 832): The [Personal Data Protection] Bill also allows individuals to seek compensation for damages directly suffered from a breach of the data protection rules through private rights of action. [emphasis added] 78 Applying this test, I agree with the DJ that SKM’s breach of the PDPA did not directly lead to the purported emotional distress suffered by Mr Piper arising from Ms Loi’s filing of her POHA claim against him and her publication of the process via the Album (Judgment at [94]−[100]). In this regard, I broadly accept SKM’s argument (see [32] above) that Ms Loi’s actions broke the chain of causation between SKM’s breach and Mr Piper’s purported emotional distress, much like a novus actus interveniens in the context of common law torts. As observed in Gary Chan Kok Yew & Lee Pey Woan, The Law of Torts in Singapore (Academy Publishing, 2nd Ed, 2016) at para 07.078, in assessing whether the intervening action of a third party constitutes a novus actus interveniens sufficient to break the chain of causation at law, it is relevant to consider the likelihood of the third party’s act occurring: In order that the chain [of causation] is not broken by a novus actus interveniens, it has been said that the alleged intervention of human action must be something likely to occur, or the risks of such a happening was “glaringly obvious”, or there was “manifest and obvious risk”. [emphasis in original omitted] 79 In the present case, while I have earlier found (at [69] above) that one would reasonably expect the possibility of a person who is the subject of a complaint taking some form of retaliatory action against the complainant if the latter’s identity is leaked to the former, I do not think that Ms Loi’s retaliatory behaviour, ie, to have commenced an action against Mr Piper and to have documented this process publicly via the Album, can be said to be “likely to occur” or “glaringly obvious”, or to have posed a “manifest and obvious risk”. My finding is bolstered by Mr Piper’s submission that Ms Loi had, in publicly documenting the process of her POHA claim, further revealed details such as Mr Piper’s surname and the case number assigned to her POHA claim (through which Mr Piper’s identity can be established through a search of the hearing list via the Judiciary’s website).51 ##### Foot Note 51 × Piper’s AEIC at para 56. 80 Given this, I find that Ms Loi’s behaviour broke the legal chain of causation between SKM’s breaches of the PDPA and the purported emotional distress suffered by Mr Piper. Indeed, I note that Mr Piper has commenced his own POHA claim against Ms Loi on 27 July 2023. 52 ##### Foot Note 52 × Piper’s AEIC at para 63(a). For the avoidance of doubt, I make no comment on this claim in this judgment. Whether Mr Piper suffered any loss actionable under s 48O of the PDPA 81 I turn to consider Mr Piper’s second broad argument, that he suffered emotional distress actionable under s 48O of the PDPA due to SKM’s breaches of the PDPA per se. Preliminarily, I accept that this head of damages could have been better pleaded (see [33] above). However, I also note that Mr Piper has pleaded that SKM’s “response … in respect of its PDPA breaches exacerbated the emotional distress” he suffered, 53 ##### Foot Note 53 × See ROA at p 379 paras 22−24. which could, when interpreted charitably, be understood as averring that he suffered actionable emotional distress due to SKM’s breaches per se. I hence proceed to consider this argument substantively. 82 I am unable to find that Mr Piper suffered actionable emotional distress. In Reed, the"
    },
    {
      "title": "[2021] SGHC 125 - elitigation.sg",
      "url": "https://www.elitigation.sg/gd/s/2021_SGHC_125",
      "snippet": "1 The Personal Data Protection Act 2012 (Act 26 of 2012) (“PDPA”) governs the collection, use and disclosure of personal data by organisations. The regulatory authority, the Personal Data Protection C...",
      "relevance_score": 0.8177694,
      "case_year": "2021",
      "court": null,
      "full_content": "grounds of decision [Data Protection] — [Personal Data Protection Act] — [Right of private action] — [Loss or damage] [Statutory Interpretation] — [Construction of statute] — [Interpretation Act] — [Purposive approach] * * * This judgment is subject to final editorial corrections approved by the court and/or redaction pursuant to the publisher’s duty in compliance with the law, for publication in LawNet and/or the Singapore Law Reports. Bellingham, Alex v Reed, Michael [2021] SGHC 125 General Division of the High Court — Registrar’s Appeal No 24 of 2019 (District Court Originating Summons No 170 of 2018) Chua Lee Ming J 11 September, 12 October 2020 25 May 2021 Chua Lee Ming J: Introduction 1 The Personal Data Protection Act 2012 (Act 26 of 2012) (“PDPA”) governs the collection, use and disclosure of personal data by organisations. The regulatory authority, the Personal Data Protection Commission (the “Commission”), is empowered to, among other things, administer and enforce the PDPA. In addition, s 32 PDPA creates a right of private action. It gives any person who suffers “loss or damage”, as a result of contraventions of certain provisions in the PDPA, a right of action for relief in civil proceedings in a court. 2 The references to the PDPA in these"
    }
  ],
  "timestamp": "2025-09-14T03:08:21.514843"
}
